Revit 2024 API
ParameterTypeId.StairsRuntypeTotalDepth Property
 "Total Depth": Total Depth
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsRuntypeTotalDepth { get; }
Visual Basic
Public Shared ReadOnly Property StairsRuntypeTotalDepth As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsRuntypeTotalDepth {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace